testEdo/Labs/Lab04-heatTransfer/combustorRhoPimpleBlown/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)	cellLimited	Gauss	linear	1;
}

divSchemes
{
    default         			none;
    div(phi,U)      			Gauss linearUpwind grad(U);
    div(phi,k)      			Gauss limitedLinear 1;
    div(phi,epsilon) 			Gauss limitedLinear 1;
    div(phi,omega)  			Gauss limitedLinear 1;
    div(phi,v2)     			Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U))))) 	Gauss linear;
    div(nonlinearStress) 		Gauss linear;
    div(phi,h)				Gauss limitedLinear 1;	// Convection of enthalpy
    div(phi,K)				Gauss limitedLinear 1;	// Convection of kinetic energy
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;		// Compressible stress tensor
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
